---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.PipingVelocity
source: html/a965f095-fd63-bd6e-c6a2-128ed23b9dbe.htm
---
# Autodesk.Revit.DB.SpecTypeId.PipingVelocity Property

Velocity, in discipline Piping.

## Syntax (C#)
```csharp
public static ForgeTypeId PipingVelocity { get; }
```